Testes Host Ubuntu/benchmark_controle_filesystem1.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 8MiB each
1GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      404.35
    writes/s:                     269.57
    fsyncs/s:                     864.40

Throughput:
    read, MiB/s:                  6.32
    written, MiB/s:               4.21

General statistics:
    total time:                          66.4746s
    total number of events:              102135

Latency (ms):
         min:                                    0.00
         avg:                                    0.60
         max:                                 2959.72
         95th percentile:                        0.95
         sum:                                61212.47

Threads fairness:
    events (avg/stddev):           102135.0000/0.00
    execution time (avg/stddev):   61.2125/0.00