Testes Host Ubuntu/benchmark_docker_filesystem.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 8MiB each
1GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      617.50
    writes/s:                     411.67
    fsyncs/s:                     1318.60

Throughput:
    read, MiB/s:                  9.65
    written, MiB/s:               6.43

General statistics:
    total time:                          60.0474s
    total number of events:              140852

Latency (ms):
         min:                                    0.00
         avg:                                    0.42
         max:                                   50.27
         95th percentile:                        0.97
         sum:                                59776.37

Threads fairness:
    events (avg/stddev):           140852.0000/0.00
    execution time (avg/stddev):   59.7764/0.00